{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report linking two features—fixing the blank page rendering issue and auditing index.html for correct script/bundle setup—to their relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each tool component and shared file's purpose and key implementation details.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH-based CSS color tokens for light and dark modes, plus global border and background body styles.",
  "frontend/index.html": "HTML entry point that loads CDN scripts for PDF.js, jsPDF, pdf-lib, and Mammoth.js before the React module bundle, with a styled dark loading placeholder inside the root div.",
  "frontend/src/App.tsx": "Root React component managing active tool state and rendering Hero, ToolGrid, Footer, FloatingParticles, and ConversionModal, each wrapped in individual ErrorBoundary instances.",
  "frontend/src/components/ConversionModal.tsx": "Modal dialog component that wraps a tool's UI in a styled dark glassmorphism panel with a header title and close button.",
  "frontend/src/components/ConversionProgress.tsx": "Progress indicator component displaying a labeled percentage bar with a shimmer animation for file conversion operations.",
  "frontend/src/components/DownloadButton.tsx": "Button component that triggers a Blob download via a temporary anchor element, showing a checkmark icon when a result blob is available.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches component tree errors and renders either a custom fallback or a default dark-themed error UI with Try Again and Reload Page buttons.",
  "frontend/src/components/FileUploadZone.tsx": "A reusable drag-and-drop file upload component that supports single or multiple file selection, displays selected files with size info, and allows removing individual files.",
  "frontend/src/components/FloatingParticles.tsx": "A decorative canvas-based component that renders animated, pulsing, colored particles floating across the full viewport background.",
  "frontend/src/components/Footer.tsx": "A site footer displaying the ConvertHub brand, a list of available tools, privacy guarantees, and a copyright bar with a Caffeine.ai attribution link.",
  "frontend/src/components/Hero.tsx": "The page header component showing the ConvertHub logo, app name, tagline, and decorative background glows and a spinning ring animation.",
  "frontend/src/components/ToolCard.tsx": "A styled button card component for a single conversion tool, showing its icon, name, description, badge, and hover animations with a glow effect.",
  "frontend/src/components/ToolGrid.tsx": "Renders a responsive grid of all eight conversion tool cards (PDF, image, Word tools) using ToolCard, with a section heading and click handler to open a selected tool.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed since all processing is client-side; exports nothing.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, imports Inter and Space Grotesk fonts, defines CSS custom properties for light/dark themes using OKLCH colors, and adds utility classes for glass effects and gradient text.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider, mounting it to the root DOM element.",
  "frontend/src/tools/ImageCompressor.tsx": "Client-side image compression tool that uses an HTML Canvas to re-encode images as JPEG at a user-selected quality level, displaying size reduction stats and providing a download button for the result.",
  "frontend/src/tools/ImageResizer.tsx": "Client-side image resizing tool that loads image dimensions on file selection, supports optional aspect-ratio locking, and uses Canvas to draw and export the resized image as a downloadable blob.",
  "frontend/src/tools/ImageToPdf.tsx": "Client-side tool that converts one or more uploaded images into a multi-page PDF using the jsPDF library, with image previews, per-image removal, and a download trigger.",
  "frontend/src/tools/ImageToWord.tsx": "React component that converts an uploaded image file (PNG/JPEG) into a .docx file by manually constructing a ZIP-based OOXML package with the image embedded at scaled dimensions.",
  "frontend/src/tools/MergePdfs.tsx": "React component that lets users upload multiple PDFs, reorder them, and merge them into a single downloadable PDF using the pdf-lib library loaded on the window object.",
  "frontend/src/tools/PdfToImage.tsx": "React component that converts each page of an uploaded PDF into a PNG image using PDF.js, displaying previews and offering individual or bulk download.",
  "frontend/src/tools/PdfToWord.tsx": "React component that extracts text from a PDF via PDF.js and packages it into a manually constructed .docx (ZIP/OOXML) file for download.",
  "frontend/src/tools/WordToPdf.tsx": "React component that converts an uploaded .docx file to a PDF by extracting raw text with Mammoth.js and rendering it page-by-page using jsPDF.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, CSS-variable-based colors, border radii, box shadows, and keyframe animations.",
  "project_state.json": "Tracks ConvertHub project state (version 7), describing an 8-tool client-side PDF/Image conversion web app with dark glassmorphism UI, known white-screen bug, and architectural notes about CDN libraries (PDF.js, jsPDF, Canvas API)."
}