{
  "kind": "build_request",
  "title": "Fix white screen / blank app rendering issue",
  "projectName": "ConvertHub",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Fix the application not rendering — the browser shows only a plain white page with the raw repository/project name ('pdf-image-converter-toolkit') and a Caffeine export description instead of the ConvertHub UI. Ensure the React app mounts correctly and the full ConvertHub interface (Hero, ToolGrid, Footer, FloatingParticles) is visible on page load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "it showing like this"
        ]
      },
      "acceptanceCriteria": [
        "Opening the app URL shows the ConvertHub dark glassmorphism UI, not a plain white page",
        "The Hero section with the ConvertHub logo and tagline is visible",
        "The 8 tool cards are displayed in the responsive grid",
        "No raw repository/project name text is shown to the user",
        "Browser console shows no fatal JavaScript errors on load",
        "The React root element is mounted and renders the full App component tree"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Audit index.html to confirm the React bundle script tag is present, points to the correct entry file (e.g. /src/main.tsx or the built output), and that the root div with id='root' exists. Ensure CDN scripts for PDF.js, jsPDF, pdf-lib, and Mammoth.js are loaded synchronously before the React bundle so all globals are available at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "index.html contains a <div id='root'></div> element",
        "The React entry script tag references the correct module path",
        "All CDN library script tags appear before the React bundle script tag",
        "PDF.js workerSrc is set in an inline script after the PDF.js CDN script loads",
        "Page loads without 404 errors for any script resources"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Verify that main.tsx correctly calls ReactDOM.createRoot on the element with id='root' and renders the App component. Add a console error and visible fallback message if the root element is not found in the DOM.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ]
      },
      "acceptanceCriteria": [
        "main.tsx finds the root element and mounts the React app without throwing",
        "If root element is missing, a visible error message is shown instead of a blank page",
        "App.tsx renders without uncaught exceptions on initial mount"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All conversion processing must remain client-side — no backend changes required"
  ],
  "nonGoals": [
    "Adding new conversion tools or features",
    "Changing the visual design or theme",
    "Modifying backend/main.mo"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}