{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix white screen / blank app rendering issue",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Fix the application not rendering — ensure the React app mounts correctly and the full ConvertHub interface (Hero, ToolGrid, Footer, FloatingParticles) is visible on page load instead of showing a plain white page with raw repository/project name text.",
      "acceptanceCriteria": [
        "Opening the app URL shows the ConvertHub dark glassmorphism UI, not a plain white page",
        "The Hero section with the ConvertHub logo and tagline is visible",
        "The 8 tool cards are displayed in the responsive grid",
        "No raw repository/project name text is shown to the user",
        "Browser console shows no fatal JavaScript errors on load",
        "The React root element is mounted and renders the full App component tree"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove or comment out any visible text content showing 'pdf-image-converter-toolkit' or 'Exported from Caffeine project' that appears in the body. Ensure only the <div id='root'></div> element is present as content, with all text moved to meta tags or removed entirely. Verify the root div is correctly placed and not hidden by other elements."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add defensive null checks and error logging at the component mount level. Wrap the return statement in a Fragment if needed and add a data-testid or console log to confirm the component renders. Ensure ErrorBoundary is properly wrapping all child components and that the FloatingParticles, Hero, ToolGrid, Footer, and ConversionModal render without throwing exceptions."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Verify the component renders without errors. Check that any image references (e.g., logo or background images) use correct paths. If the component references frontend/public/assets/generated/converthub-logo.dim_256x256.png or frontend/public/assets/generated/hero-bg.dim_1920x600.png, ensure those paths are valid and the images are loaded as static assets. Add fallback rendering or alt attributes to prevent blank renders if images fail to load."
        },
        {
          "path": "frontend/src/components/FloatingParticles.tsx",
          "operation": "modify",
          "description": "Add error handling around canvas operations to prevent crashes if the canvas element is null or if getContext('2d') fails. Ensure the component does not block rendering of other UI elements if animation initialization fails."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Audit index.html to confirm the React bundle script tag is present, points to the correct entry file, and that the root div with id='root' exists. Ensure CDN scripts for PDF.js, jsPDF, pdf-lib, and Mammoth.js are loaded synchronously before the React bundle so all globals are available at runtime.",
      "acceptanceCriteria": [
        "index.html contains a <div id='root'></div> element",
        "The React entry script tag references the correct module path",
        "All CDN library script tags appear before the React bundle script tag",
        "PDF.js workerSrc is set in an inline script after the PDF.js CDN script loads",
        "Page loads without 404 errors for any script resources"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify the <div id='root'></div> element exists in the body. Confirm the React entry script tag (e.g., <script type='module' src='/src/main.tsx'></script>) is present and points to the correct path. Ensure all CDN scripts (PDF.js, jsPDF, pdf-lib, Mammoth.js) are loaded with <script> tags before the React bundle script, and that the PDF.js workerSrc initialization script appears immediately after the PDF.js CDN script. Check for any incorrect paths or missing script tags that would cause 404 errors."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Verify that main.tsx correctly calls ReactDOM.createRoot on the element with id='root' and renders the App component. Add a console error and visible fallback message if the root element is not found in the DOM.",
      "acceptanceCriteria": [
        "main.tsx finds the root element and mounts the React app without throwing",
        "If root element is missing, a visible error message is shown instead of a blank page",
        "App.tsx renders without uncaught exceptions on initial mount"
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add a null check after document.getElementById('root'). If the root element is not found, log a console error and insert a visible fallback message directly into the document body (e.g., document.body.innerHTML = '<div style=\"padding: 20px; color: red;\">Error: Root element not found. Please ensure index.html contains <div id=\"root\"></div></div>'). Ensure ReactDOM.createRoot is called only if the root element exists, and that the App component is rendered inside QueryClientProvider and InternetIdentityProvider without throwing exceptions."
        }
      ]
    }
  ]
}